In [1]:
import pandas as pd
import numpy as np

In [3]:
# Hierarchial Indexing
# setting two or more index level on an axis

In [10]:
data = pd.Series(np.random.randn(9),
index=[
    ['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], # outer level
    [1, 2, 3, 1, 3, 1, 2, 2, 3] # inner level
])

In [11]:
data

a  1    1.521776
   2   -0.436374
   3    0.110456
b  1    0.050069
   3    2.132872
c  1    1.859599
   2   -0.716904
d  2   -2.269625
   3   -1.912887
dtype: float64

In [12]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [13]:
# partial indexing
data['b']

1    0.050069
3    2.132872
dtype: float64

In [14]:
data['b':'c']

b  1    0.050069
   3    2.132872
c  1    1.859599
   2   -0.716904
dtype: float64

In [15]:
data.loc[['b','c']]

b  1    0.050069
   3    2.132872
c  1    1.859599
   2   -0.716904
dtype: float64

In [16]:
# selection on the inner level
data.loc[:,2]

a   -0.436374
c   -0.716904
d   -2.269625
dtype: float64

In [17]:
# rearrange the data into a df
data.unstack()

          1         2         3
a  1.521776 -0.436374  0.110456
b  0.050069       NaN  2.132872
c  1.859599 -0.716904       NaN
d       NaN -2.269625 -1.912887

In [18]:
# see the outer level becomes row indices and inner level becomes column indices

In [19]:
data.unstack().stack()

a  1    1.521776
   2   -0.436374
   3    0.110456
b  1    0.050069
   3    2.132872
c  1    1.859599
   2   -0.716904
d  2   -2.269625
   3   -1.912887
dtype: float64

In [20]:
# with a df any axis can become multi indexed
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']]
)

In [21]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [22]:
# when naming indexes you must pass lists
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']

In [23]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [24]:
# partial indexing
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [25]:
# Reordering and Sorting Levels

In [26]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [27]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [30]:
# sorting index by a specefic level
frame.sort_index(level='key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [31]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [32]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [33]:
# summary stat by level

In [34]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),\
    'c': ['one', 'one', 'one', 'two', 'two',\
    'two', 'two'],\
    'd': [0, 1, 2, 0, 1, 2, 3]})

In [35]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [36]:
# make a column as index
frame2 = frame.set_index(['c'])

In [38]:
frame2 
# auto range indexing has been vanished

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [39]:
frame2 = frame.set_index(['c','d'])

In [40]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [41]:
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [42]:
# reset index does the op
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [43]:
# auto range indexing

In [44]:
# Combining and Merging Datasets

In [45]:
# Summary Statistics by Level

In [46]:
# Database-Style DataFrame Joins
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})

In [47]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [49]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [50]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [51]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0